IOsetting/py32f0-template/Misc/py32f030xx.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1"
	xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
	xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">

	<vendor>Puya</vendor>
	<vendorID>Puya</vendorID>
	<name>PY32F0xx_DFP</name>
	<!-- name of part-->
	<series>PY32F0</series>
	<version>1.0.0</version>
	<description>Arm 32-bit Cortex-M0+ Microcontroller based device, CPU clock up to 48 MHz.</description>

	<cpu>
		<!-- details about the cpu embedded in the device -->
		<name>CM0+</name>
		<revision>r0p1</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>4</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	
	
	<addressUnitBits>8</addressUnitBits><!-- byte addressable memory -->
	<width>32</width>                   <!-- bus width is 32 bits --><!-- default settings implicitly inherited by subsequent sections -->
	<size>32</size>                    <!-- this is the default size (number of bits) of all peripherals and register that do not define "size" themselves -->
	<access>read-write</access>           <!-- default access permission for all subsequent registers -->
	<resetValue>0x00000000</resetValue>    <!-- by default all bits of the registers are initialized to 0 on reset -->
	<resetMask>0xFFFFFFFF</resetMask>           <!-- by default all 32Bits of the registers are used -->
	<peripherals>
		<peripheral>
			<name>ADC</name>
			<description>Analog to Digital Converter</description>
			<groupName>ADC</groupName>
			<baseAddress>0x40012400</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC_COMP</name>
				<description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
				<value>12</value>
			</interrupt>
			<registers>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>ADC interrupt and status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWD</name>
							<description>ADC analog watchdog  flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVR</name>
							<description>ADC group regular overrun
							flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOSEQ</name>
							<description>ADC group regular end of sequence
							conversions flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOC</name>
							<description>ADC group regular end of unitary
							conversion flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOSMP</name>
							<description>ADC group regular end of sampling
							flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<displayName>IER</displayName>
					<description>ADC interrupt enable register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDIE</name>
							<description>ADC analog watchdog
							interrupt</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVRIE</name>
							<description>ADC group regular overrun
							interrupt</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOSEQIE</name>
							<description>ADC group regular end of sequence
							conversions interrupt</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOCIE</name>
							<description>ADC group regular end of unitary
							conversion interrupt</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOSMPIE</name>
							<description>ADC group regular end of sampling
							interrupt</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR</name>
					<displayName>CR</displayName>
					<description>ADC control register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADCAL</name>
							<description>ADC group regular conversion
							calibration</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADSTP</name>
							<description>ADC group regular conversion
							stop</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADSTART</name>
							<description>ADC group regular conversion
							start</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADEN</name>
							<description>ADC enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR1</name>
					<displayName>CFGR1</displayName>
					<description>ADC configuration register 1</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWDCH</name>
							<description>ADC analog watchdog  monitored channel
							selection</description>
							<bitOffset>26</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>AWDEN</name>
							<description>ADC analog watchdog  enable on scope
							ADC group regular</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWDSGL</name>
							<description>ADC analog watchdog  monitoring a
							single channel or all channels</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DISCEN</name>
							<description>ADC group regular sequencer
							discontinuous mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>WAIT</name>
							<description>Wait conversion mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CONT</name>
							<description>ADC group regular continuous conversion
							mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVRMOD</name>
							<description>ADC group regular overrun
							configuration</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEN</name>
							<description>ADC group regular external trigger
							polarity</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>EXTSEL</name>
							<description>ADC group regular external trigger
							source</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>ALIGN</name>
							<description>ADC data alignement</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RESSEL</name>
							<description>ADC data resolution</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SCANDIR</name>
							<description>Scan sequence direction</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMACFG</name>
							<description>ADC DMA transfer
							configuration</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DMAEN</name>
							<description>ADC DMA transfer enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR2</name>
					<displayName>CFGR2</displayName>
					<description>ADC configuration register 2</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CKMODE</name>
							<description>ADC clock mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>SMPR</name>
					<displayName>SMPR</displayName>
					<description>ADC sampling time register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>SMP</name>
							<description>Sampling time selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TR</name>
					<displayName>TR</displayName>
					<description>ADC analog watchdog 1 threshold register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFF0000</resetValue>
					<fields>
						<field>
							<name>HT</name>
							<description>ADC analog watchdog threshold
							high</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
						<field>
							<name>LT</name>
							<description>ADC analog watchdog threshold
							low</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHSELR</name>
					<displayName>CHSELR</displayName>
					<description>ADC group regular sequencer register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0FFF0000</resetValue>
					<fields>
						<field>
							<name>CHSEL12</name>
							<description>Channel-12 selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL11</name>
							<description>Channel-11 selection</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL9</name>
							<description>Channel-9 selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL8</name>
							<description>Channel-8 selection</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL7</name>
							<description>Channel-7 selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL6</name>
							<description>Channel-6 selection</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL5</name>
							<description>Channel-5 selection</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL4</name>
							<description>Channel-4 selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL3</name>
							<description>Channel-3 selection</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL2</name>
							<description>Channel-2 selection</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL1</name>
							<description>Channel-1 selection</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHSEL0</name>
							<description>Channel-0 selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DR</name>
					<displayName>DR</displayName>
					<description>ADC group regular data register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DATA</name>
							<description>ADC group regular conversion
							data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCSR</name>
					<displayName>CCSR</displayName>
					<description>ADC calibration configuration and status register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CALON</name>
							<description>Calibration flag</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CALFAIL</name>
							<description>Calibration fail flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CALSET</name>
							<description>Calibration factor selection</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CALSMP</name>
							<description>Calibration sample time selection</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CALSEL</name>
							<description>Calibration contents selection</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CALRR1</name>
					<displayName>CALRR1</displayName>
					<description>ADC calibration result register 1</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CALBOUT</name>
							<description>offset result</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>CALC5OUT</name>
							<description>C5 result</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC4OUT</name>
							<description>C4 result</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CALRR2</name>
					<displayName>CALRR2</displayName>
					<description>ADC calibration result register 2</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CALC3OUT</name>
							<description>C3 result</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC2OUT</name>
							<description>C2 result</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC1OUT</name>
							<description>C1 result</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC0OUT</name>
							<description>C0 result</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CALFIR1</name>
					<displayName>CALFIR1</displayName>
					<description>ADC calibration factor input register 1</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CALBIO</name>
							<description>Calibration offset factor input</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>CALC5IO</name>
							<description>Calibration C5 factor input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC4IO</name>
							<description>Calibration C4 factor input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CALFIR2</name>
					<displayName>CALFIR2</displayName>
					<description>ADC calibration factor input register 2</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CALC3IO</name>
							<description>Calibration C3 factor input</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC2IO</name>
							<description>Calibration C2 factor input</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC1IO</name>
							<description>Calibration C1 factor input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CALC0IO</name>
							<description>Calibration C0 factor input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<displayName>CCR</displayName>
					<description>ADC common configuration register</description>
					<addressOffset>0x308</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TSEN</name>
							<description>Temperature sensor enable</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VREFEN</name>
							<description>VREFINT enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>						
					</fields>
				</register>
