IOsetting/py32f0-template/Misc/py32f030xx.svd
				<register>
					<name>EXTICR3</name>
					<displayName>EXTICR3</displayName>
					<description>EXTI external interrupt selection
					register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EXTI8</name>
							<description>GPIO port selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IMR</name>
					<displayName>IMR</displayName>
					<description>EXTI CPU wakeup with interrupt mask
					register</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0xFFF80000</resetValue>
					<fields>
						<field>
							<name>IM29</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM19</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM18</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM17</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM16</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM15</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM14</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM13</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM12</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM11</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM10</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM9</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM8</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM7</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM6</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM5</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM4</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM3</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM2</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM1</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IM0</name>
							<description>CPU wakeup with interrupt mask on event
							input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EMR</name>
					<displayName>EMR</displayName>
					<description>EXTI CPU wakeup with event mask
					register</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EM29</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM19</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM18</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM17</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM16</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM15</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM14</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM13</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM12</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM11</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM10</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM9</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM8</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM7</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM6</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM5</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM4</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM3</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM2</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM1</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EM0</name>
							<description>CPU wakeup with event mask on event
							input</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
