IOsetting/py32f0-template/Misc/py32f030xx.svd
				</registers>
		</peripheral>
		<peripheral derivedFrom="TIM16">
				<name>TIM17</name>
				<baseAddress>0x40014800</baseAddress>
				<interrupt>
					<name>TIM17</name>
					<description>TIM17 global Interrupt</description>
					<value>22</value>
				</interrupt>
		</peripheral>
		<peripheral>
				<name>SYSCFG</name>
				<description>System configuration controller</description>
				<groupName>SYSCFG</groupName>
				<baseAddress>0x40010000</baseAddress>
				<addressBlock>
					<offset>0x0</offset>
					<size>0x30</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>CFGR1</name>
						<displayName>CFGR1</displayName>
						<description>SYSCFG configuration register
						1</description>
						<addressOffset>0x0</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>I2C_PF1_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PF1</description>
								<bitOffset>30</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PF0_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PF0</description>
								<bitOffset>29</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PB8_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PB8</description>
								<bitOffset>28</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PB7_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PB7</description>
								<bitOffset>27</bitOffset>
								<bitWidth>1</bitWidth>
							</field><field>
								<name>I2C_PB6_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PB6</description>
								<bitOffset>26</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA12_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA12</description>
								<bitOffset>25</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA11_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA11</description>
								<bitOffset>24</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA10_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA10</description>
								<bitOffset>23</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA9_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA9</description>
								<bitOffset>22</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA8_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA8</description>
								<bitOffset>21</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA7_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA7</description>
								<bitOffset>20</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA3_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA3</description>
								<bitOffset>19</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>I2C_PA2_ANF</name>
								<description> Analog filter enable control driving capability
								activation bits PA2</description>
								<bitOffset>18</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>MEM_MODE</name>
								<description>Memory mapping selection
								bits</description>
								<bitOffset>0</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CFGR2</name>
						<displayName>CFGR2</displayName>
						<description>SYSCFG configuration register
						2</description>
						<addressOffset>0x18</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>ETR_SRC_TIM1</name>
								<description>TIM1 ETR source selection</description>
								<bitOffset>9</bitOffset>
								<bitWidth>2</bitWidth>
							</field>
							<field>
								<name>COMP2_BRK_TIM17</name>
								<description>COMP2 is enable to input of TIM17 break</description>
								<bitOffset>8</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMP1_BRK_TIM17</name>
								<description>COMP1 is enable to input of TIM17 break</description>
								<bitOffset>7</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMP2_BRK_TIM16</name>
								<description>COMP2 is enable to input of TIM16 break</description>
								<bitOffset>6</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMP1_BRK_TIM16</name>
								<description>COMP1 is enable to input of TIM16 break</description>
								<bitOffset>5</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMP2_BRK_TIM1</name>
								<description>COMP2 is enable to input of TIM1 break</description>
								<bitOffset>4</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>COMP1_BRK_TIM1</name>
								<description>COMP1 is enable to input of TIM1 break </description>
								<bitOffset>3</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>PVD_LOCK</name>
								<description>PVD lock enable bit</description>
								<bitOffset>2</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
							<field>
								<name>LOCKUP_LOCK</name>
								<description>Cortex-M0+ LOCKUP bit enable
								bit</description>
								<bitOffset>0</bitOffset>
								<bitWidth>1</bitWidth>
							</field>
						</fields>
					</register>
					<register>
						<name>CFGR3</name>
						<displayName>CFGR3</displayName>
						<description>SYSCFG configuration register
						3</description>
						<addressOffset>0x1C</addressOffset>
						<size>0x20</size>
						<access>read-write</access>
						<resetValue>0x00000000</resetValue>
						<fields>
							<field>
								<name>DMA3_MAP</name>
								<description>DMA channel3 requeset selection</description>
								<bitOffset>16</bitOffset>
								<bitWidth>5</bitWidth>
							</field>
							<field>
								<name>DMA2_MAP</name>
								<description>DMA channel2 requeset selection</description>
								<bitOffset>8</bitOffset>
								<bitWidth>5</bitWidth>
							</field>
							<field>
								<name>DMA1_MAP</name>
								<description>DMA channel1 requeset selection</description>
								<bitOffset>0</bitOffset>
								<bitWidth>5</bitWidth>
							</field>
						</fields>
					</register>
